app/views/comments/_comments.html.erb

<p><u>Comments</u></p>
<% @question.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."question_id" = ?  [["question_id", 1]]