app/controllers/comments_controller.rb

    def create

     @question = Question.find(params[:question_id])
     @comment = @question.comments.create(comment_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("username", "body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "yo"], ["body", "me"], ["question_id", 1], ["created_at", "2017-12-09 21:07:50.328952"], ["updated_at", "2017-12-09 21:07:50.328952"]]

    def destroy
     @question = Question.find(params[:question_id])
     @comment = @question.comments.find(params[:id])
     @comment.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."question_id" = ? AND "comments"."id" = ? LIMIT 1  [["question_id", 1], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]