app/controllers/questions_controller.rb

    def create
        @question = current_user.questions.build(question_params)
        if @question.save
---
INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["body", "I am bob"], ["created_at", "2017-12-09 16:58:50.710943"], ["updated_at", "2017-12-09 16:58:50.710943"]]